#Regular Expression part1.

#1.sys.time
#2.sys.time.period
#3.sys.date.time
#4.sys.date.time.period
#5.sys.number
#6.sys.number.times
#7.sys.number.percent
regEx1=(정오)?(오전)?((\d+분|\d+시|\d+초)\s+뒤?)?
regEx2=((오전|오후)?)*\s?((아침|점심|저녁)?)*\s?((\d+시부터\s?\d+시까지)?)*
regEx3=(내일|현재|오늘|모레|(\d+월\s?\d일))?\s((오전|오후)?\s?((\d+시)?\s?(\d+분)?))?
regEx4=(([월화수목금토일]요일)|오늘|내일|모레|글피|어[제|젯]|(\d+월\s?\d일))?\s?((낮|밤|저녁|오전|오후)?)*\s?((아침|점심|저녁)?)*\s?((\d+시부터\s?\d+시까지)?)*
regEx5=((일|이|삼|사|오|육|칠|팔|구|십)?|(하나|둘|셋|넷|다섯|여섯|일곱|여덟|아홉)?)*(((\d+)(명|개))?((하나|둘|셋|넷|다섯|여섯|일곱|여덟|아홉)\s?(명|개))?)*(열명|열개)?
regEx6=(\d+(화|부|편|차|회|회차))*
regEx7=(\d+(퍼센트|프로|%))*
